{"format": "graph-model", "generatedBy": "2.0.0-dev20190603", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"node": [{"name": "sub_2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}, {"name": "MobilenetV1/offset_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "34"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/offset_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "34"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_13_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_13_pointwise/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "1024"}]}}}}}, {"name": "MobilenetV1/Conv2d_13_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_13_depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1024"}, {"size": "1"}]}}}}}, {"name": "MobilenetV1/Conv2d_12_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_12_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_12_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_12_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_11_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_11_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_11_depthwise/depthwise_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "MobilenetV1/Conv2d_11_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_10_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_10_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_10_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_10_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_9_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_9_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_9_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_9_depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "MobilenetV1/Conv2d_8_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_8_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_8_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_8_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_7_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_7_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_7_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_7_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_6_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_6_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_6_depthwise/depthwise_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "MobilenetV1/Conv2d_6_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_5_pointwise/Conv2D_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "MobilenetV1/Conv2d_5_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_5_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_5_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_4_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_4_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_4_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_4_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_3_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_3_pointwise/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "MobilenetV1/Conv2d_3_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_3_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_2_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_2_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_2_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_2_depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}}}, {"name": "MobilenetV1/Conv2d_1_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_1_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_1_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_1_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_0/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_0/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/heatmap_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "17"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/heatmap_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "17"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/displacement_fwd_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/displacement_fwd_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/displacement_bwd_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/displacement_bwd_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["sub_2", "MobilenetV1/Conv2d_0/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_0/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_0/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_0/Relu6", "MobilenetV1/Conv2d_1_depthwise/depthwise_weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_1_depthwise/depthwise_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_1_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_1_depthwise/Relu6", "MobilenetV1/Conv2d_1_pointwise/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_1_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_1_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_1_pointwise/Relu6", "MobilenetV1/Conv2d_2_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_2_depthwise/depthwise_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_2_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_2_depthwise/Relu6", "MobilenetV1/Conv2d_2_pointwise/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_2_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_2_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_2_pointwise/Relu6", "MobilenetV1/Conv2d_3_depthwise/depthwise_weights"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_3_depthwise/depthwise_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_3_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_3_depthwise/Relu6", "MobilenetV1/Conv2d_3_pointwise/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_3_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_3_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_3_pointwise/Relu6", "MobilenetV1/Conv2d_4_depthwise/depthwise_weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_4_depthwise/depthwise_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_4_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_4_depthwise/Relu6", "MobilenetV1/Conv2d_4_pointwise/weights"], "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_4_pointwise/Conv2D_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_4_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_4_pointwise/Relu6", "MobilenetV1/Conv2d_5_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_5_depthwise/depthwise_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_5_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_5_depthwise/Relu6", "MobilenetV1/Conv2d_5_pointwise/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_5_pointwise/Conv2D_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_5_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_5_pointwise/Relu6", "MobilenetV1/Conv2d_6_depthwise/depthwise_weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_6_depthwise/depthwise_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_6_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_6_depthwise/Relu6", "MobilenetV1/Conv2d_6_pointwise/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_6_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_6_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_6_pointwise/Relu6", "MobilenetV1/Conv2d_7_depthwise/depthwise_weights"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_7_depthwise/depthwise_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_7_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_7_depthwise/Relu6", "MobilenetV1/Conv2d_7_pointwise/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_7_pointwise/Conv2D_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_7_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_7_pointwise/Relu6", "MobilenetV1/Conv2d_8_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_8_depthwise/depthwise_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_8_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_8_depthwise/Relu6", "MobilenetV1/Conv2d_8_pointwise/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_8_pointwise/Conv2D_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_8_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_8_pointwise/Relu6", "MobilenetV1/Conv2d_9_depthwise/depthwise_weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_9_depthwise/depthwise_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_9_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_9_depthwise/Relu6", "MobilenetV1/Conv2d_9_pointwise/weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_9_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_9_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_9_pointwise/Relu6", "MobilenetV1/Conv2d_10_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_10_depthwise/depthwise_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_10_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_10_depthwise/Relu6", "MobilenetV1/Conv2d_10_pointwise/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_10_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_10_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_10_pointwise/Relu6", "MobilenetV1/Conv2d_11_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_11_depthwise/depthwise_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_11_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_11_depthwise/Relu6", "MobilenetV1/Conv2d_11_pointwise/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_11_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_11_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_11_pointwise/Relu6", "MobilenetV1/Conv2d_12_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_12_depthwise/depthwise_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_12_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_12_depthwise/Relu6", "MobilenetV1/Conv2d_12_pointwise/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_12_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_12_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_12_pointwise/Relu6", "MobilenetV1/Conv2d_13_depthwise/depthwise_weights"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["2", "2", "1", "1"]}}}}, {"name": "MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_13_depthwise/depthwise_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_13_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_13_depthwise/Relu6", "MobilenetV1/Conv2d_13_pointwise/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_13_pointwise/Conv2D_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_13_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/offset_2/BiasAdd/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_13_pointwise/Relu6", "MobilenetV1/offset_2/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "MobilenetV1/heatmap_2/BiasAdd/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_13_pointwise/Relu6", "MobilenetV1/heatmap_2/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/displacement_fwd_2/BiasAdd/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_13_pointwise/Relu6", "MobilenetV1/displacement_fwd_2/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "MobilenetV1/displacement_bwd_2/BiasAdd/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_13_pointwise/Relu6", "MobilenetV1/displacement_bwd_2/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/offset_2/BiasAdd", "op": "BiasAdd", "input": ["MobilenetV1/offset_2/BiasAdd/conv", "MobilenetV1/offset_2/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/heatmap_2/BiasAdd", "op": "BiasAdd", "input": ["MobilenetV1/heatmap_2/BiasAdd/conv", "MobilenetV1/heatmap_2/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/displacement_fwd_2/BiasAdd", "op": "BiasAdd", "input": ["MobilenetV1/displacement_fwd_2/BiasAdd/conv", "MobilenetV1/displacement_fwd_2/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/displacement_bwd_2/BiasAdd", "op": "BiasAdd", "input": ["MobilenetV1/displacement_bwd_2/BiasAdd/conv", "MobilenetV1/displacement_bwd_2/Conv2D_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 54}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "MobilenetV1/offset_2/Conv2D_bias", "shape": [34], "dtype": "float32", "quantization": {"min": -0.41840287189857633, "scale": 0.0028270464317471373, "dtype": "uint8"}}, {"name": "MobilenetV1/offset_2/weights", "shape": [1, 1, 1024, 34], "dtype": "float32", "quantization": {"min": -0.7433138569196065, "scale": 0.005674151579538981, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_13_pointwise/Conv2D_bias", "shape": [1024], "dtype": "float32", "quantization": {"min": -38.783679199218746, "scale": 0.3127716064453125, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_13_pointwise/weights", "shape": [1, 1, 1024, 1024], "dtype": "float32", "quantization": {"min": -10.360311652164834, "scale": 0.05340366831012801, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_13_depthwise/depthwise_bias", "shape": [1024], "dtype": "float32", "quantization": {"min": -7.43779219085095, "scale": 0.08084556729185816, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_13_depthwise/depthwise_weights", "shape": [3, 3, 1024, 1], "dtype": "float32", "quantization": {"min": -132.6657378252815, "scale": 0.6085584303911995, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_12_pointwise/Conv2D_bias", "shape": [1024], "dtype": "float32", "quantization": {"min": -11.29024175382128, "scale": 0.09330778308943206, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_12_pointwise/weights", "shape": [1, 1, 512, 1024], "dtype": "float32", "quantization": {"min": -1.1891880904926975, "scale": 0.009218512329400755, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_12_depthwise/depthwise_bias", "shape": [512], "dtype": "float32", "quantization": {"min": -6.732698113310571, "scale": 0.04914378184898227, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_12_depthwise/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32", "quantization": {"min": -1.6595836237365125, "scale": 0.07543561926075057, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_11_pointwise/Conv2D_bias", "shape": [512], "dtype": "float32", "quantization": {"min": -7.571861072615081, "scale": 0.0728063564674527, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_11_pointwise/weights", "shape": [1, 1, 512, 512], "dtype": "float32", "quantization": {"min": -0.7233745537552179, "scale": 0.006576132306865617, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_11_depthwise/depthwise_bias", "shape": [512], "dtype": "float32", "quantization": {"min": -11.458139600940779, "scale": 0.0686116143768909, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_11_depthwise/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32", "quantization": {"min": -2.9266500519771204, "scale": 0.06226915004206639, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_10_pointwise/Conv2D_bias", "shape": [512], "dtype": "float32", "quantization": {"min": -8.184706334506764, "scale": 0.05420335320865407, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_10_pointwise/weights", "shape": [1, 1, 512, 512], "dtype": "float32", "quantization": {"min": -0.6848291018429924, "scale": 0.006007272823184144, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_10_depthwise/depthwise_bias", "shape": [512], "dtype": "float32", "quantization": {"min": -8.792654188941507, "scale": 0.06325650495641372, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_10_depthwise/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32", "quantization": {"min": -16.58592701332242, "scale": 0.1764460320566215, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_9_pointwise/Conv2D_bias", "shape": [512], "dtype": "float32", "quantization": {"min": -5.838284492492676, "scale": 0.053075313568115234, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_9_pointwise/weights", "shape": [1, 1, 512, 512], "dtype": "float32", "quantization": {"min": -0.6809579769770304, "scale": 0.005770830313364664, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_9_depthwise/depthwise_bias", "shape": [512], "dtype": "float32", "quantization": {"min": -8.856628268372779, "scale": 0.06326163048837699, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_9_depthwise/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32", "quantization": {"min": -4.5935654172710345, "scale": 0.036748523338168276, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_8_pointwise/Conv2D_bias", "shape": [512], "dtype": "float32", "quantization": {"min": -5.257537909115062, "scale": 0.044555406009449676, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_8_pointwise/weights", "shape": [1, 1, 512, 512], "dtype": "float32", "quantization": {"min": -0.7748704498889399, "scale": 0.006053675389757343, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_8_depthwise/depthwise_bias", "shape": [512], "dtype": "float32", "quantization": {"min": -11.907926278955797, "scale": 0.07305476244758158, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_8_depthwise/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32", "quantization": {"min": -5.888744264490464, "scale": 0.04748987310072955, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_7_pointwise/Conv2D_bias", "shape": [512], "dtype": "float32", "quantization": {"min": -3.179837052962359, "scale": 0.033828053754918715, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_7_pointwise/weights", "shape": [1, 1, 512, 512], "dtype": "float32", "quantization": {"min": -1.0931264956792195, "scale": 0.006430155856936586, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_7_depthwise/depthwise_bias", "shape": [512], "dtype": "float32", "quantization": {"min": -6.601210435231526, "scale": 0.07766129923801796, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_7_depthwise/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32", "quantization": {"min": -36.745543147068396, "scale": 0.31140290802600334, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_6_pointwise/Conv2D_bias", "shape": [512], "dtype": "float32", "quantization": {"min": -16.363313330856023, "scale": 0.11944024329091989, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_6_pointwise/weights", "shape": [1, 1, 256, 512], "dtype": "float32", "quantization": {"min": -1.6316635987337897, "scale": 0.0164814504922605, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_6_depthwise/depthwise_bias", "shape": [256], "dtype": "float32", "quantization": {"min": -1.8819474566216563, "scale": 0.04091190123090557, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_6_depthwise/depthwise_weights", "shape": [3, 3, 256, 1], "dtype": "float32", "quantization": {"min": -22.46891377766927, "scale": 0.18120091756184895, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_5_pointwise/Conv2D_bias", "shape": [256], "dtype": "float32", "quantization": {"min": -5.549523218940286, "scale": 0.04743182238410501, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_5_pointwise/weights", "shape": [1, 1, 256, 256], "dtype": "float32", "quantization": {"min": -1.5333933381473317, "scale": 0.012169788397994695, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_5_depthwise/depthwise_bias", "shape": [256], "dtype": "float32", "quantization": {"min": -5.621998609281054, "scale": 0.07701367957919251, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_5_depthwise/depthwise_weights", "shape": [3, 3, 256, 1], "dtype": "float32", "quantization": {"min": -4.543978517195758, "scale": 0.03522463966818417, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_4_pointwise/Conv2D_bias", "shape": [256], "dtype": "float32", "quantization": {"min": -14.780172157287598, "scale": 0.09660243240057254, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_4_pointwise/weights", "shape": [1, 1, 128, 256], "dtype": "float32", "quantization": {"min": -1.8258150025910023, "scale": 0.013727932350308288, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_4_depthwise/depthwise_bias", "shape": [128], "dtype": "float32", "quantization": {"min": -15.126722231098249, "scale": 0.08743770075779335, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_4_depthwise/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32", "quantization": {"min": -1.7810497283935547, "scale": 0.09894720713297527, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_3_pointwise/Conv2D_bias", "shape": [128], "dtype": "float32", "quantization": {"min": -9.347539322049009, "scale": 0.07478031457639207, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_3_pointwise/weights", "shape": [1, 1, 128, 128], "dtype": "float32", "quantization": {"min": -1.6853296508976057, "scale": 0.018520106053819842, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_3_depthwise/depthwise_bias", "shape": [128], "dtype": "float32", "quantization": {"min": -4.626823189679314, "scale": 0.046735587774538526, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_3_depthwise/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32", "quantization": {"min": -19.46578519484576, "scale": 0.30898071737850413, "dtype": "uint8"}}, {"name": "MobilenetV1/Conv2d_2_pointwise/Conv2D_bias", "shape": [128], "dtype": "float32", "quantization": {"min": -7.692320614235074, "scale": 0.08183319802377738, "dtype": 