{"modelTopology":{"class_name":"Sequential","config":{"name":"whatsapp case study 20","layers":[{"class_name":"Dense","config":{"units":373,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense133","trainable":true,"batch_input_shape":[null,520],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.3441713725713742,"noise_shape":null,"seed":null,"name":"dropout_Dropout102","trainable":true}},{"class_name":"Dense","config":{"units":371,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense134","trainable":true}},{"class_name":"Dropout","config":{"rate":0.3441713725713742,"noise_shape":null,"seed":null,"name":"dropout_Dropout103","trainable":true}},{"class_name":"Dense","config":{"units":145,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense135","trainable":true}},{"class_name":"Dropout","config":{"rate":0.3441713725713742,"noise_shape":null,"seed":null,"name":"dropout_Dropout104","trainable":true}},{"class_name":"Dense","config":{"units":20,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense136","trainable":true}}]},"keras_version":"tfjs-layers 2.4.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.4.0","convertedBy":null,"weightsManifest":[{"paths":["./whatsapp case study 20.weights.bin"],"weights":[{"name":"dense_Dense133/kernel","shape":[520,373],"dtype":"float32"},{"name":"dense_Dense133/bias","shape":[373],"dtype":"float32"},{"name":"dense_Dense134/kernel","shape":[373,371],"dtype":"float32"},{"name":"dense_Dense134/bias","shape":[371],"dtype":"float32"},{"name":"dense_Dense135/kernel","shape":[371,145],"dtype":"float32"},{"name":"dense_Dense135/bias","shape":[145],"dtype":"float32"},{"name":"dense_Dense136/kernel","shape":[145,20],"dtype":"float32"}]}]}