{"modelTopology":{"class_name":"Sequential","config":{"name":"whatsapp case study 10","layers":[{"class_name":"Dense","config":{"units":173,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense71","trainable":true,"batch_input_shape":[null,520],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.375969254605243,"noise_shape":null,"seed":null,"name":"dropout_Dropout55","trainable":true}},{"class_name":"Dense","config":{"units":250,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense72","trainable":true}},{"class_name":"Dropout","config":{"rate":0.375969254605243,"noise_shape":null,"seed":null,"name":"dropout_Dropout56","trainable":true}},{"class_name":"Dense","config":{"units":79,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense73","trainable":true}},{"class_name":"Dropout","config":{"rate":0.375969254605243,"noise_shape":null,"seed":null,"name":"dropout_Dropout57","trainable":true}},{"class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense74","trainable":true}}]},"keras_version":"tfjs-layers 2.4.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.4.0","convertedBy":null,"weightsManifest":[{"paths":["./whatsapp case study 10.weights.bin"],"weights":[{"name":"dense_Dense71/kernel","shape":[520,173],"dtype":"float32"},{"name":"dense_Dense71/bias","shape":[173],"dtype":"float32"},{"name":"dense_Dense72/kernel","shape":[173,250],"dtype":"float32"},{"name":"dense_Dense72/bias","shape":[250],"dtype":"float32"},{"name":"dense_Dense73/kernel","shape":[250,79],"dtype":"float32"},{"name":"dense_Dense73/bias","shape":[79],"dtype":"float32"},{"name":"dense_Dense74/kernel","shape":[79,10],"dtype":"float32"}]}]}