{"modelTopology":{"class_name":"Sequential","config":{"name":"whatsapp case study 20","layers":[{"class_name":"Dense","config":{"units":226,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense199","trainable":true,"batch_input_shape":[null,520],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.31403783104596905,"noise_shape":null,"seed":null,"name":"dropout_Dropout151","trainable":true}},{"class_name":"Dense","config":{"units":180,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense200","trainable":true}},{"class_name":"Dropout","config":{"rate":0.31403783104596905,"noise_shape":null,"seed":null,"name":"dropout_Dropout152","trainable":true}},{"class_name":"Dense","config":{"units":68,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense201","trainable":true}},{"class_name":"Dropout","config":{"rate":0.31403783104596905,"noise_shape":null,"seed":null,"name":"dropout_Dropout153","trainable":true}},{"class_name":"Dense","config":{"units":20,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense202","trainable":true}}]},"keras_version":"tfjs-layers 2.4.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.4.0","convertedBy":null,"weightsManifest":[{"paths":["./whatsapp case study 20.weights.bin"],"weights":[{"name":"dense_Dense199/kernel","shape":[520,226],"dtype":"float32"},{"name":"dense_Dense199/bias","shape":[226],"dtype":"float32"},{"name":"dense_Dense200/kernel","shape":[226,180],"dtype":"float32"},{"name":"dense_Dense200/bias","shape":[180],"dtype":"float32"},{"name":"dense_Dense201/kernel","shape":[180,68],"dtype":"float32"},{"name":"dense_Dense201/bias","shape":[68],"dtype":"float32"},{"name":"dense_Dense202/kernel","shape":[68,20],"dtype":"float32"}]}]}