{"modelTopology":{"class_name":"Sequential","config":{"name":"whatsapp multi-category case study 3","layers":[{"class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense142","trainable":true,"batch_input_shape":[null,515],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.19203367134208732,"noise_shape":null,"seed":null,"name":"dropout_Dropout109","trainable":true}},{"class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense143","trainable":true}},{"class_name":"Dropout","config":{"rate":0.19203367134208732,"noise_shape":null,"seed":null,"name":"dropout_Dropout110","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense144","trainable":true}}]},"keras_version":"tfjs-layers 2.8.2","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.8.2","convertedBy":null,"weightsManifest":[{"paths":["./whatsapp multi-category case study 3.weights.bin"],"weights":[{"name":"dense_Dense142/kernel","shape":[515,64],"dtype":"float32"},{"name":"dense_Dense142/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense143/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense143/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense144/kernel","shape":[32,3],"dtype":"float32"}]}]}