{"modelTopology":{"class_name":"Sequential","config":{"name":"whatsapp case study 10","layers":[{"class_name":"Dense","config":{"units":62,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense40","trainable":true,"batch_input_shape":[null,520],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.35192097812459605,"noise_shape":null,"seed":null,"name":"dropout_Dropout24","trainable":true}},{"class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense41","trainable":true}}]},"keras_version":"tfjs-layers 2.4.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.4.0","convertedBy":null,"weightsManifest":[{"paths":["./whatsapp case study 10.weights.bin"],"weights":[{"name":"dense_Dense40/kernel","shape":[520,62],"dtype":"float32"},{"name":"dense_Dense40/bias","shape":[62],"dtype":"float32"},{"name":"dense_Dense41/kernel","shape":[62,10],"dtype":"float32"}]}]}