{"modelTopology":{"class_name":"Sequential","config":{"name":"whatsapp case study 10","layers":[{"class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense56","trainable":true,"batch_input_shape":[null,520],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.4058471369061405,"noise_shape":null,"seed":null,"name":"dropout_Dropout42","trainable":true}},{"class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense57","trainable":true}},{"class_name":"Dropout","config":{"rate":0.4058471369061405,"noise_shape":null,"seed":null,"name":"dropout_Dropout43","trainable":true}},{"class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense58","trainable":true}},{"class_name":"Dropout","config":{"rate":0.4058471369061405,"noise_shape":null,"seed":null,"name":"dropout_Dropout44","trainable":true}},{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense59","trainable":true}},{"class_name":"Dropout","config":{"rate":0.4058471369061405,"noise_shape":null,"seed":null,"name":"dropout_Dropout45","trainable":true}},{"class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense60","trainable":true}}]},"keras_version":"tfjs-layers 2.4.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.4.0","convertedBy":null,"weightsManifest":[{"paths":["./whatsapp case study 10.weights.bin"],"weights":[{"name":"dense_Dense56/kernel","shape":[520,256],"dtype":"float32"},{"name":"dense_Dense56/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense57/kernel","shape":[256,256],"dtype":"float32"},{"name":"dense_Dense57/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense58/kernel","shape":[256,256],"dtype":"float32"},{"name":"dense_Dense58/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense59/kernel","shape":[256,128],"dtype":"float32"},{"name":"dense_Dense59/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense60/kernel","shape":[128,10],"dtype":"float32"}]}]}