{"modelTopology":{"class_name":"Sequential","config":{"name":"whatsapp case study","layers":[{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense20","trainable":true,"batch_input_shape":[null,520],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.3083265724280966,"noise_shape":null,"seed":null,"name":"dropout_Dropout14","trainable":true}},{"class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense21","trainable":true}},{"class_name":"Dropout","config":{"rate":0.3083265724280966,"noise_shape":null,"seed":null,"name":"dropout_Dropout15","trainable":true}},{"class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22","trainable":true}}]},"keras_version":"tfjs-layers 2.0.1","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.0.1","convertedBy":null,"weightsManifest":[{"paths":["./whatsapp case study.weights.bin"],"weights":[{"name":"dense_Dense20/kernel","shape":[520,128],"dtype":"float32"},{"name":"dense_Dense20/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense21/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense21/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense22/kernel","shape":[64,10],"dtype":"float32"}]}]}