{"modelTopology":{"class_name":"Sequential","config":{"name":"whatsapp case study 20","layers":[{"class_name":"Dense","config":{"units":160,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense19","trainable":true,"batch_input_shape":[null,520],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.1470353634807122,"noise_shape":null,"seed":null,"name":"dropout_Dropout15","trainable":true}},{"class_name":"Dense","config":{"units":151,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense20","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1470353634807122,"noise_shape":null,"seed":null,"name":"dropout_Dropout16","trainable":true}},{"class_name":"Dense","config":{"units":84,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense21","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1470353634807122,"noise_shape":null,"seed":null,"name":"dropout_Dropout17","trainable":true}},{"class_name":"Dense","config":{"units":20,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22","trainable":true}}]},"keras_version":"tfjs-layers 2.4.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.4.0","convertedBy":null,"weightsManifest":[{"paths":["./whatsapp case study 20.weights.bin"],"weights":[{"name":"dense_Dense19/kernel","shape":[520,160],"dtype":"float32"},{"name":"dense_Dense19/bias","shape":[160],"dtype":"float32"},{"name":"dense_Dense20/kernel","shape":[160,151],"dtype":"float32"},{"name":"dense_Dense20/bias","shape":[151],"dtype":"float32"},{"name":"dense_Dense21/kernel","shape":[151,84],"dtype":"float32"},{"name":"dense_Dense21/bias","shape":[84],"dtype":"float32"},{"name":"dense_Dense22/kernel","shape":[84,20],"dtype":"float32"}]}]}