{"modelTopology":{"class_name":"Sequential","config":{"name":"whatsapp case study 3","layers":[{"class_name":"Dense","config":{"units":191,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense41","trainable":true,"batch_input_shape":[null,516],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.4358703256463283,"noise_shape":null,"seed":null,"name":"dropout_Dropout31","trainable":true}},{"class_name":"Dense","config":{"units":126,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense42","trainable":true}},{"class_name":"Dropout","config":{"rate":0.4358703256463283,"noise_shape":null,"seed":null,"name":"dropout_Dropout32","trainable":true}},{"class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense43","trainable":true}},{"class_name":"Dropout","config":{"rate":0.4358703256463283,"noise_shape":null,"seed":null,"name":"dropout_Dropout33","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense44","trainable":true}}]},"keras_version":"tfjs-layers 2.8.2","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.8.2","convertedBy":null,"weightsManifest":[{"paths":["./whatsapp case study 3.weights.bin"],"weights":[{"name":"dense_Dense41/kernel","shape":[516,191],"dtype":"float32"},{"name":"dense_Dense41/bias","shape":[191],"dtype":"float32"},{"name":"dense_Dense42/kernel","shape":[191,126],"dtype":"float32"},{"name":"dense_Dense42/bias","shape":[126],"dtype":"float32"},{"name":"dense_Dense43/kernel","shape":[126,32],"dtype":"float32"},{"name":"dense_Dense43/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense44/kernel","shape":[32,3],"dtype":"float32"}]}]}