{"modelTopology":{"class_name":"Sequential","config":{"name":"whatsapp case study","layers":[{"class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense266","trainable":true,"batch_input_shape":[null,520],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.20639859051554343,"noise_shape":null,"seed":null,"name":"dropout_Dropout195","trainable":true}},{"class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense267","trainable":true}},{"class_name":"Dropout","config":{"rate":0.20639859051554343,"noise_shape":null,"seed":null,"name":"dropout_Dropout196","trainable":true}},{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense268","trainable":true}},{"class_name":"Dropout","config":{"rate":0.20639859051554343,"noise_shape":null,"seed":null,"name":"dropout_Dropout197","trainable":true}},{"class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense269","trainable":true}}]},"keras_version":"tfjs-layers 2.3.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.3.0","convertedBy":null,"weightsManifest":[{"paths":["./whatsapp case study.weights.bin"],"weights":[{"name":"dense_Dense266/kernel","shape":[520,256],"dtype":"float32"},{"name":"dense_Dense266/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense267/kernel","shape":[256,256],"dtype":"float32"},{"name":"dense_Dense267/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense268/kernel","shape":[256,128],"dtype":"float32"},{"name":"dense_Dense268/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense269/kernel","shape":[128,10],"dtype":"float32"}]}]}