{"modelTopology":{"class_name":"Sequential","config":{"name":"whatsapp logistics 3","layers":[{"class_name":"Dense","config":{"units":147,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense24","trainable":true,"batch_input_shape":[null,516],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.42175964971452684,"noise_shape":null,"seed":null,"name":"dropout_Dropout18","trainable":true}},{"class_name":"Dense","config":{"units":114,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense25","trainable":true}},{"class_name":"Dropout","config":{"rate":0.42175964971452684,"noise_shape":null,"seed":null,"name":"dropout_Dropout19","trainable":true}},{"class_name":"Dense","config":{"units":50,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense26","trainable":true}},{"class_name":"Dropout","config":{"rate":0.42175964971452684,"noise_shape":null,"seed":null,"name":"dropout_Dropout20","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense27","trainable":true}}]},"keras_version":"tfjs-layers 2.8.2","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.8.2","convertedBy":null,"weightsManifest":[{"paths":["./whatsapp logistics 3.weights.bin"],"weights":[{"name":"dense_Dense24/kernel","shape":[516,147],"dtype":"float32"},{"name":"dense_Dense24/bias","shape":[147],"dtype":"float32"},{"name":"dense_Dense25/kernel","shape":[147,114],"dtype":"float32"},{"name":"dense_Dense25/bias","shape":[114],"dtype":"float32"},{"name":"dense_Dense26/kernel","shape":[114,50],"dtype":"float32"},{"name":"dense_Dense26/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense27/kernel","shape":[50,3],"dtype":"float32"}]}]}