{"modelTopology":{"class_name":"Sequential","config":{"name":"whatsapp case study","layers":[{"class_name":"Dense","config":{"units":491,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense25","trainable":true,"batch_input_shape":[null,520],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.3316529132921465,"noise_shape":null,"seed":null,"name":"dropout_Dropout19","trainable":true}},{"class_name":"Dense","config":{"units":413,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense26","trainable":true}},{"class_name":"Dropout","config":{"rate":0.3316529132921465,"noise_shape":null,"seed":null,"name":"dropout_Dropout20","trainable":true}},{"class_name":"Dense","config":{"units":193,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense27","trainable":true}},{"class_name":"Dropout","config":{"rate":0.3316529132921465,"noise_shape":null,"seed":null,"name":"dropout_Dropout21","trainable":true}},{"class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense28","trainable":true}}]},"keras_version":"tfjs-layers 2.4.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.4.0","convertedBy":null,"weightsManifest":[{"paths":["./whatsapp case study.weights.bin"],"weights":[{"name":"dense_Dense25/kernel","shape":[520,491],"dtype":"float32"},{"name":"dense_Dense25/bias","shape":[491],"dtype":"float32"},{"name":"dense_Dense26/kernel","shape":[491,413],"dtype":"float32"},{"name":"dense_Dense26/bias","shape":[413],"dtype":"float32"},{"name":"dense_Dense27/kernel","shape":[413,193],"dtype":"float32"},{"name":"dense_Dense27/bias","shape":[193],"dtype":"float32"},{"name":"dense_Dense28/kernel","shape":[193,10],"dtype":"float32"}]}]}