{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":100,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true,"batch_input_shape":[null,9],"dtype":"float32"}},{"class_name":"Dense","config":{"units":50,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true}},{"class_name":"Dense","config":{"units":20,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true}}],"keras_version":"tfjs-layers 0.8.1","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./rvr-10000.weights.bin"],"weights":[{"name":"dense_Dense5/kernel","shape":[9,100],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[100,50],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense7/kernel","shape":[50,20],"dtype":"float32"},{"name":"dense_Dense7/bias","shape":[20],"dtype":"float32"},{"name":"dense_Dense8/kernel","shape":[20,1],"dtype":"float32"}]}]}