{"modelTopology":{"class_name":"Sequential","config":{"name":"whatsapp case study","layers":[{"class_name":"Dense","config":{"units":10,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense54","trainable":true,"batch_input_shape":[null,514],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.260960947803862,"noise_shape":null,"seed":null,"name":"dropout_Dropout39","trainable":true}},{"class_name":"Dense","config":{"units":10,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense55","trainable":true}},{"class_name":"Dropout","config":{"rate":0.260960947803862,"noise_shape":null,"seed":null,"name":"dropout_Dropout40","trainable":true}},{"class_name":"Dense","config":{"units":100,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense56","trainable":true}},{"class_name":"Dropout","config":{"rate":0.260960947803862,"noise_shape":null,"seed":null,"name":"dropout_Dropout41","trainable":true}},{"class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense57","trainable":true}}]},"keras_version":"tfjs-layers 2.0.1","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.0.1","convertedBy":null,"weightsManifest":[{"paths":["./whatsapp case study.weights.bin"],"weights":[{"name":"dense_Dense54/kernel","shape":[514,10],"dtype":"float32"},{"name":"dense_Dense54/bias","shape":[10],"dtype":"float32"},{"name":"dense_Dense55/kernel","shape":[10,10],"dtype":"float32"},{"name":"dense_Dense55/bias","shape":[10],"dtype":"float32"},{"name":"dense_Dense56/kernel","shape":[10,100],"dtype":"float32"},{"name":"dense_Dense56/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense57/kernel","shape":[100,10],"dtype":"float32"}]}]}