{"modelTopology":{"class_name":"Sequential","config":{"name":"confidences","layers":[{"class_name":"Dense","config":{"units":179,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense342","trainable":true,"batch_input_shape":[null,512],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.33,"noise_shape":null,"seed":null,"name":"dropout_Dropout269","trainable":true}},{"class_name":"Dense","config":{"units":189,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense343","trainable":true}},{"class_name":"Dropout","config":{"rate":0.33,"noise_shape":null,"seed":null,"name":"dropout_Dropout270","trainable":true}},{"class_name":"Dense","config":{"units":145,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense344","trainable":true}},{"class_name":"Dropout","config":{"rate":0.33,"noise_shape":null,"seed":null,"name":"dropout_Dropout271","trainable":true}},{"class_name":"Dense","config":{"units":143,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense345","trainable":true}},{"class_name":"Dropout","config":{"rate":0.33,"noise_shape":null,"seed":null,"name":"dropout_Dropout272","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense346","trainable":true}}]},"keras_version":"tfjs-layers 1.5.1","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.5.1","convertedBy":null,"weightsManifest":[{"paths":["./confidences.weights.bin"],"weights":[{"name":"dense_Dense342/kernel","shape":[512,179],"dtype":"float32"},{"name":"dense_Dense342/bias","shape":[179],"dtype":"float32"},{"name":"dense_Dense343/kernel","shape":[179,189],"dtype":"float32"},{"name":"dense_Dense343/bias","shape":[189],"dtype":"float32"},{"name":"dense_Dense344/kernel","shape":[189,145],"dtype":"float32"},{"name":"dense_Dense344/bias","shape":[145],"dtype":"float32"},{"name":"dense_Dense345/kernel","shape":[145,143],"dtype":"float32"},{"name":"dense_Dense345/bias","shape":[143],"dtype":"float32"},{"name":"dense_Dense346/kernel","shape":[143,1],"dtype":"float32"}]}]}