{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":27,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense9","trainable":true,"batch_input_shape":[null,21],"dtype":"float32"}},{"class_name":"Dense","config":{"units":27,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10","trainable":true}},{"class_name":"Dense","config":{"units":27,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true}}],"keras_version":"tfjs-layers 0.8.4","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./iweekly flu.weights.bin"],"weights":[{"name":"dense_Dense9/kernel","shape":[21,27],"dtype":"float32"},{"name":"dense_Dense9/bias","shape":[27],"dtype":"float32"},{"name":"dense_Dense10/kernel","shape":[27,27],"dtype":"float32"},{"name":"dense_Dense10/bias","shape":[27],"dtype":"float32"},{"name":"dense_Dense11/kernel","shape":[27,27],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[27],"dtype":"float32"},{"name":"dense_Dense12/kernel","shape":[27,1],"dtype":"float32"}]}]}