{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":100,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true,"batch_input_shape":[null,27],"dtype":"float32"}},{"class_name":"Dense","config":{"units":50,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true}}],"keras_version":"tfjs-layers 0.8.3","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./tic tac toe 1.weights.bin"],"weights":[{"name":"dense_Dense4/kernel","shape":[27,100],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[100,50],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[50,1],"dtype":"float32"}]}]}