{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":1000,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense423","trainable":true,"batch_input_shape":[null,1280],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout261","trainable":true}},{"class_name":"Dense","config":{"units":100,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense424","trainable":true}},{"class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout262","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense425","trainable":true}}],"keras_version":"tfjs-layers 1.2.8","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.2.8","convertedBy":null,"weightsManifest":[{"paths":["./06-10-2019b.weights.bin"],"weights":[{"name":"dense_Dense423/kernel","shape":[1280,1000],"dtype":"float32"},{"name":"dense_Dense423/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense424/kernel","shape":[1000,100],"dtype":"float32"},{"name":"dense_Dense424/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense425/kernel","shape":[100,3],"dtype":"float32"}]}]}