{"format": "graph-model", "generatedBy": "1.15.0-dev20190802", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"node": [{"name": "sub_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_v1_50/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/conv1/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/Pad_1/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/Conv2D_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Conv2D_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/Conv2D_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Conv2D_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_4/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_4/bottleneck_v1/conv2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_4/bottleneck_v1/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_4/bottleneck_v1/conv3/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_1/bottleneck_v1/shortcut/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_1/bottleneck_v1/shortcut/Conv2D_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "resnet_v1_50/block3/unit_1/bottleneck_v1/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_1/bottleneck_v1/conv1/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_1/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_1/bottleneck_v1/conv2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_1/bottleneck_v1/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_1/bottleneck_v1/conv3/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_2/bottleneck_v1/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_2/bottleneck_v1/conv1/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_2/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_2/bottleneck_v1/conv2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_2/bottleneck_v1/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_2/bottleneck_v1/conv3/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_3/bottleneck_v1/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_3/bottleneck_v1/conv1/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_3/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_3/bottleneck_v1/conv2/Conv2D_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "resnet_v1_50/block3/unit_3/bottleneck_v1/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_3/bottleneck_v1/conv3/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_4/bottleneck_v1/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_4/bottleneck_v1/conv1/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_4/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_4/bottleneck_v1/conv2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_4/bottleneck_v1/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_4/bottleneck_v1/conv3/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_5/bottleneck_v1/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_5/bottleneck_v1/conv1/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_5/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_5/bottleneck_v1/conv2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_5/bottleneck_v1/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_5/bottleneck_v1/conv3/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_6/bottleneck_v1/conv1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}}}, {"name": "resnet_v1_50/block3/unit_6/bottleneck_v1/conv1/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_6/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_6/bottleneck_v1/conv2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_6/bottleneck_v1/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block3/unit_6/bottleneck_v1/conv3/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block4/unit_1/bottleneck_v1/shortcut/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "2048"}]}}}}}, {"name": "resnet_v1_50/block4/unit_1/bottleneck_v1/shortcut/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block4/unit_1/bottleneck_v1/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block4/unit_1/bottleneck_v1/conv1/Conv2D_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "resnet_v1_50/block4/unit_1/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "resnet_v1_50/block4/unit_1/bottleneck_v1/conv2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block4/unit_1/bottleneck_v1/conv3/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "2048"}]}}}}}, {"name": "resnet_v1_50/block4/unit_1/bottleneck_v1/conv3/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block4/unit_2/bottleneck_v1/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block4/unit_2/bottleneck_v1/conv1/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block4/unit_2/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block4/unit_2/bottleneck_v1/conv2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block4/unit_2/bottleneck_v1/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block4/unit_2/bottleneck_v1/conv3/Conv2D_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}}}, {"name": "resnet_v1_50/block4/unit_3/bottleneck_v1/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block4/unit_3/bottleneck_v1/conv1/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block4/unit_3/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block4/unit_3/bottleneck_v1/conv2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block4/unit_3/bottleneck_v1/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block4/unit_3/bottleneck_v1/conv3/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/displacement_bwd_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/displacement_bwd_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/displacement_fwd_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/displacement_fwd_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/heatmap_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "17"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/heatmap_2/Conv2D_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "17"}]}}}}}, {"name": "resnet_v1_50/embedding_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "34"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/embedding_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "34"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/offset_2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "34"}]}}}}}, {"name": "resnet_v1_50/offset_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "34"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/part_heatmap_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/part_heatmap_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/part_offset_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/part_offset_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "clip_by_value/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "clip_by_value/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/segment_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/segment_2/Conv2D_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_v1_50/Pad", "op": "Pad", "input": ["sub_2", "resnet_v1_50/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/conv1/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/Pad", "resnet_v1_50/conv1/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "resnet_v1_50/conv1/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/conv1/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/conv1/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/conv1/Relu", "op": "Relu", "input": ["resnet_v1_50/conv1/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/Pad_1", "op": "Pad", "input": ["resnet_v1_50/conv1/Relu", "resnet_v1_50/Pad_1/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "resnet_v1_50/pool1/MaxPool", "op": "MaxPool", "input": ["resnet_v1_50/Pad_1"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/pool1/MaxPool", "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/pool1/MaxPool", "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Conv2D_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Relu", "op": "Relu", "input": ["resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Relu", "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Relu", "op": "Relu", "input": ["resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Relu", "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/weights"], "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/add", "op": "Add", "input": ["resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1", "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_1/bottleneck_v1/Relu", "op": "Relu", "input": ["resnet_v1_50/block1/unit_1/bottleneck_v1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/block1/unit_1/bottleneck_v1/Relu", "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Relu", "op": "Relu", "input": ["resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Relu", "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Relu", "op": "Relu", "input": ["resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Relu", "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/block1/unit_2/bottleneck_v1/add", "op": "Add", "input": ["resnet_v1_50/block1/unit_1/bottleneck_v1/Relu", "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_2/bottleneck_v1/Relu", "op": "Relu", "input": ["resnet_v1_50/block1/unit_2/bottleneck_v1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/shortcut/MaxPool", "op": "MaxPool", "input": ["resnet_v1_50/block1/unit_2/bottleneck_v1/Relu"], "attr": {"ksize": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/block1/unit_2/bottleneck_v1/Relu", "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Relu", "op": "Relu", "input": ["resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/Pad", "op": "Pad", "input": ["resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Relu", "resnet_v1_50/Pad_1/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/block1/unit_3/bottleneck_v1/Pad", "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Relu", "op": "Relu", "input": ["resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Relu", "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/add", "op": "Add", "input": ["resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1", "resnet_v1_50/block1/unit_3/bottleneck_v1/shortcut/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block1/unit_3/bottleneck_v1/Relu", "op": "Relu", "input": ["resnet_v1_50/block1/unit_3/bottleneck_v1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/block1/unit_3/bottleneck_v1/Relu", "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/block1/unit_3/bottleneck_v1/Relu", "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Conv2D_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Relu", "op": "Relu", "input": ["resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Relu", "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Conv2D_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Relu", "op": "Relu", "input": ["resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Relu", "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/add", "op": "Add", "input": ["resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1", "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_1/bottleneck_v1/Relu", "op": "Relu", "input": ["resnet_v1_50/block2/unit_1/bottleneck_v1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/block2/unit_1/bottleneck_v1/Relu", "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Relu", "op": "Relu", "input": ["resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Relu", "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Relu", "op": "Relu", "input": ["resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Relu", "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1/conv", "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "resnet_v1_50/block2/unit_2/bottleneck_v1/add", "op": "Add", "input": ["resnet_v1_50/block2/unit_1/bottleneck_v1/Relu", "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_2/bottleneck_v1/Relu", "op": "Relu", "input": ["resnet_v1_50/block2/unit_2/bottleneck_v1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", 