{"modelTopology":{"class_name":"Sequential","config":{"name":"rating predictor","layers":[{"class_name":"Dense","config":{"units":640,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense113","trainable":true,"batch_input_shape":[null,1280],"dtype":"float32"}},{"class_name":"Dense","config":{"units":320,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense114","trainable":true}},{"class_name":"Dense","config":{"units":160,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense115","trainable":true}},{"class_name":"Dense","config":{"units":80,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense116","trainable":true}},{"class_name":"Dense","config":{"units":40,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense117","trainable":true}},{"class_name":"Dense","config":{"units":20,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense118","trainable":true}},{"class_name":"Dense","config":{"units":10,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense119","trainable":true}},{"class_name":"Dense","config":{"units":5,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense120","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense121","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense122","trainable":true}}]},"keras_version":"tfjs-layers 4.1.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.1.0","convertedBy":null,"weightsManifest":[{"paths":["./rating predictor.weights.bin"],"weights":[{"name":"dense_Dense113/kernel","shape":[1280,640],"dtype":"float32"},{"name":"dense_Dense113/bias","shape":[640],"dtype":"float32"},{"name":"dense_Dense114/kernel","shape":[640,320],"dtype":"float32"},{"name":"dense_Dense114/bias","shape":[320],"dtype":"float32"},{"name":"dense_Dense115/kernel","shape":[320,160],"dtype":"float32"},{"name":"dense_Dense115/bias","shape":[160],"dtype":"float32"},{"name":"dense_Dense116/kernel","shape":[160,80],"dtype":"float32"},{"name":"dense_Dense116/bias","shape":[80],"dtype":"float32"},{"name":"dense_Dense117/kernel","shape":[80,40],"dtype":"float32"},{"name":"dense_Dense117/bias","shape":[40],"dtype":"float32"},{"name":"dense_Dense118/kernel","shape":[40,20],"dtype":"float32"},{"name":"dense_Dense118/bias","shape":[20],"dtype":"float32"},{"name":"dense_Dense119/kernel","shape":[20,10],"dtype":"float32"},{"name":"dense_Dense119/bias","shape":[10],"dtype":"float32"},{"name":"dense_Dense120/kernel","shape":[10,5],"dtype":"float32"},{"name":"dense_Dense120/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense121/kernel","shape":[5,3],"dtype":"float32"},{"name":"dense_Dense121/bias","shape":[3],"dtype":"float32"},{"name":"dense_Dense122/kernel","shape":[3,1],"dtype":"float32"}]}]}