{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":50,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10","trainable":true,"batch_input_shape":[null,27],"dtype":"float32"}},{"class_name":"Dense","config":{"units":20,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true}},{"class_name":"Dense","config":{"units":10,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true}},{"class_name":"Dense","config":{"units":5,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense14","trainable":true}}],"keras_version":"tfjs-layers 0.8.3","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./model 50-20-10-5.weights.bin"],"weights":[{"name":"dense_Dense10/kernel","shape":[27,50],"dtype":"float32"},{"name":"dense_Dense10/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense11/kernel","shape":[50,20],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[20],"dtype":"float32"},{"name":"dense_Dense12/kernel","shape":[20,10],"dtype":"float32"},{"name":"dense_Dense12/bias","shape":[10],"dtype":"float32"},{"name":"dense_Dense13/kernel","shape":[10,5],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense14/kernel","shape":[5,1],"dtype":"float32"}]}]}