{"modelTopology":{"class_name":"Sequential","config":{"name":"AI blocks QA b","layers":[{"class_name":"Dense","config":{"units":111,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense495","trainable":true,"batch_input_shape":[null,512],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout327","trainable":true}},{"class_name":"Dense","config":{"units":63,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense496","trainable":true}},{"class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout328","trainable":true}},{"class_name":"Dense","config":{"units":52,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense497","trainable":true}},{"class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout329","trainable":true}},{"class_name":"Dense","config":{"units":6,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense498","trainable":true}}]},"keras_version":"tfjs-layers 1.5.1","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.5.1","convertedBy":null,"weightsManifest":[{"paths":["./AI blocks QA b.weights.bin"],"weights":[{"name":"dense_Dense495/kernel","shape":[512,111],"dtype":"float32"},{"name":"dense_Dense495/bias","shape":[111],"dtype":"float32"},{"name":"dense_Dense496/kernel","shape":[111,63],"dtype":"float32"},{"name":"dense_Dense496/bias","shape":[63],"dtype":"float32"},{"name":"dense_Dense497/kernel","shape":[63,52],"dtype":"float32"},{"name":"dense_Dense497/bias","shape":[52],"dtype":"float32"},{"name":"dense_Dense498/kernel","shape":[52,6],"dtype":"float32"}]}]}