{"modelTopology":{"class_name":"Sequential","config":{"name":"female","layers":[{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true,"batch_input_shape":[null,300],"dtype":"float32"}}]},"keras_version":"tfjs-layers 3.11.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.11.0","convertedBy":null,"weightsManifest":[{"paths":["./female.weights.bin"],"weights":[{"name":"dense_Dense4/kernel","shape":[300,1],"dtype":"float32"}]}]}